niffler_tests/internal/soap/templates/xml/current_user.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <currentUserRequest xmlns="niffler-userdata">
            <username>john</username>
        </currentUserRequest>
    </soap:Body>
</soap:Envelope>